Revit 2026 API

# ParameterTypeIdNumberSystemTextSize Property

---

"Number Size"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId NumberSystemTextSize { get; }
```
```vb
Public Shared ReadOnly Property NumberSystemTextSize As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ NumberSystemTextSize {
	ForgeTypeId^ get ();
}
```
```fsharp
static member NumberSystemTextSize : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace